app/controllers/collages_controller.rb

SELECT "collagephotos".* FROM "collagephotos" WHERE "collagephotos"."id" = ? LIMIT 1  [["id", :current_user]]
---
def index
   @photos = Collagephoto.where("user_id = #{current_user.id}")

INSERT INTO "collagephotos" ("created_at", "image_url", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 29 May 2014 17:05:40 UTC +00:00], ["image_url", nil], ["updated_at", Thu, 29 May 2014 17:05:40 UTC +00:00], ["user_id", 23]]
---
def create
  instagram_api_url = "https://api.instagram.com/v1/users/" + current_user.uid + "/media/recent/?access_token="+ current_user.instagram_token
  @instagram_data = HTTParty.get instagram_api_url
    @instagram_data['data'].each do | image |
      @collagephoto = Collagephoto.new
      @collagephoto.image_url = image['images']['standard_resolution']['url']
      @collagephoto.user_id = current_user.id
      @collagephoto.save